felias-fogg/TinyCore/avr/boards.txt
x61.menu.clock.1MHz_external=1 MHz external osc.
x61.menu.clock.1MHz_external.bootloader.clock=1MHz
x61.menu.clock.1MHz_external.bootloader.osc=x
x61.menu.clock.1MHz_external.bootloader.low_fuses=0xfd
x61.menu.clock.1MHz_external.bootloader.baudrate=9600
x61.menu.clock.1MHz_external.build.clocksource=1
x61.menu.clock.1MHz_external.build.f_cpu=1000000L


###################
#### ATtiny828 ####
###################

# General
828.name=ATtiny828
828.build.mcu=attiny828
828.upload.maximum_size=8192
828.upload.maximum_data_size=512
828.upload.tool=avrdude
828.upload.speed={bootloader.baudrate}
828.bootloader.tool=avrdude
828.bootloader.unlock_bits=0xff
828.bootloader.lock_bits=0xff
828.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
828.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1111
828.build.core=tinymodern
828.build.board=AVR_ATTINY828
828.build.extra_flags={build.wiremode} {build.speedfix}

# Upload port select / Bootloader
828.menu.bootloader.no_bootloader=No bootloader
828.menu.bootloader.no_bootloader.build.export_merged_output=false
828.menu.bootloader.no_bootloader.bootloader.str=
828.menu.bootloader.no_bootloader.bootloader.spm_bit=1

828.menu.bootloader.urboot_uart0=Yes (UART0)
828.menu.bootloader.urboot_uart0.build.export_merged_output=true
828.menu.bootloader.urboot_uart0.bootloader.str=-U urboot:2s_autobaud_noled_uart0_pr
828.menu.bootloader.urboot_uart0.bootloader.spm_bit=0

# EEPROM
828.menu.eeprom.keep=EEPROM retained
828.menu.eeprom.keep.bootloader.eesave_bit=0
828.menu.eeprom.erase=EEPROM not retained
828.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection
828.menu.bod.2v7=BOD 2.7V
828.menu.bod.2v7.bootloader.bod_bits=101
828.menu.bod.2v7.bootloader.bodact_bits=10
828.menu.bod.2v7.bootloader.bodpd_bits=10
828.menu.bod.4v3=BOD 4.3V
828.menu.bod.4v3.bootloader.bod_bits=100
828.menu.bod.4v3.bootloader.bodact_bits=10
828.menu.bod.4v3.bootloader.bodpd_bits=10
828.menu.bod.1v8=BOD 1.8V
828.menu.bod.1v8.bootloader.bod_bits=110
828.menu.bod.1v8.bootloader.bodact_bits=10
828.menu.bod.1v8.bootloader.bodpd_bits=10
828.menu.bod.disable=BOD disabled
828.menu.bod.disable.bootloader.bod_bits=101
828.menu.bod.disable.bootloader.bodact_bits=11
828.menu.bod.disable.bootloader.bodpd_bits=11

# Clock frequencies
828.menu.clock.8MHz_internal_5v=8 MHz internal osc. (Vcc > 4.5V)
828.menu.clock.8MHz_internal_5v.bootloader.low_fuses=0xee
828.menu.clock.8MHz_internal_5v.bootloader.baudrate=38400
828.menu.clock.8MHz_internal_5v.build.clocksource=0
828.menu.clock.8MHz_internal_5v.build.speedfix=-DLOWERCAL=9
828.menu.clock.8MHz_internal_5v.build.f_cpu=8000000L

828.menu.clock.8MHz_internal=8 MHz internal osc. (Vcc < 4.5V)
828.menu.clock.8MHz_internal.bootloader.low_fuses=0xe
828.menu.clock.8MHz_internal.bootloader.baudrate=38400
828.menu.clock.8MHz_internal.build.clocksource=0
828.menu.clock.8MHz_internal.build.speedfix=
828.menu.clock.8MHz_internal.build.f_cpu=8000000L

828.menu.clock.4MHz_internal_5v=4 MHz internal osc. (Vcc > 4.5V)
828.menu.clock.4MHz_internal_5v.bootloader.low_fuses=0x6w
828.menu.clock.4MHz_internal_5v.bootloader.baudrate=9600
828.menu.clock.4MHz_internal_5v.build.clocksource=0
828.menu.clock.4MHz_internal_5v.build.speedfix=-DLOWERCAL=9
828.menu.clock.4MHz_internal_5v.build.f_cpu=4000000L

828.menu.clock.4MHz_internal=4 MHz internal osc. (Vcc < 4.5V)
828.menu.clock.4MHz_internal.bootloader.low_fuses=0x6e
828.menu.clock.4MHz_internal.bootloader.baudrate=9600
828.menu.clock.4MHz_internal.build.clocksource=0
828.menu.clock.4MHz_internal.build.speedfix=
828.menu.clock.4MHz_internal.build.f_cpu=4000000L

828.menu.clock.1MHz_internal_5v=1 MHz internal osc. (Vcc > 4.5V)
828.menu.clock.1MHz_internal_5v.bootloader.low_fuses=0x6e
828.menu.clock.1MHz_internal_5v.bootloader.baudrate=9600
828.menu.clock.1MHz_internal_5v.build.clocksource=0
828.menu.clock.1MHz_internal_5v.build.speedfix=-DLOWERCAL
828.menu.clock.1MHz_internal_5v.build.f_cpu=1000000L

828.menu.clock.1MHz_internal=1 MHz internal osc. (Vcc < 4.5V)
828.menu.clock.1MHz_internal.bootloader.low_fuses=0x6e
828.menu.clock.1MHz_internal.bootloader.baudrate=9600
828.menu.clock.1MHz_internal.build.clocksource=0
828.menu.clock.1MHz_internal.build.speedfix=
828.menu.clock.1MHz_internal.build.f_cpu=1000000L

828.menu.clock.20MHz_external=20 MHz external CLOCK
828.menu.clock.20MHz_external.bootloader.low_fuses=0xe0
828.menu.clock.20MHz_external.bootloader.baudrate=115200
828.menu.clock.20MHz_external.build.clocksource=2
828.menu.clock.20MHz_internal.build.speedfix=
828.menu.clock.20MHz_external.build.f_cpu=20000000L

828.menu.clock.16MHz_external=16 MHz external CLOCK
828.menu.clock.16MHz_external.bootloader.low_fuses=0xe0
828.menu.clock.16MHz_external.bootloader.baudrate=115200
828.menu.clock.16MHz_external.build.clocksource=2
828.menu.clock.16MHz_internal.build.speedfix=
828.menu.clock.16MHz_external.build.f_cpu=16000000L

828.menu.clock.12MHz_external=12 MHz external CLOCK
828.menu.clock.12MHz_external.bootloader.low_fuses=0xe0
828.menu.clock.12MHz_external.bootloader.baudrate=115200
828.menu.clock.12MHz_external.build.clocksource=2
828.menu.clock.12MHz_internal.build.speedfix=
828.menu.clock.12MHz_external.build.f_cpu=12000000L

828.menu.clock.8MHz_external=8 MHz external CLOCK
828.menu.clock.8MHz_external.bootloader.low_fuses=0xe0
828.menu.clock.8MHz_external.bootloader.baudrate=38400
828.menu.clock.8MHz_external.build.clocksource=2
828.menu.clock.8MHz_internal.build.speedfix=
828.menu.clock.8MHz_external.build.f_cpu=8000000L

# Wire mode
828.menu.wiremode.amaster=Master Only
828.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
828.menu.wiremode.slave=Slave Only
828.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
828.menu.wiremode.both=Master and slave
828.menu.wiremode.both.build.wiremode=-DWIRE_BOTH


####################
#### ATtiny1634 ####
####################

# General
1634.name=ATtiny1634
1634.build.mcu=attiny1634
1634.upload.maximum_size=16384
1634.upload.maximum_data_size=1024
1634.upload.tool=avrdude
1634.upload.speed={bootloader.baudrate}
1634.bootloader.tool=avrdude
1634.bootloader.unlock_bits=0xff
1634.bootloader.lock_bits=0xff
1634.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
1634.bootloader.extended_fuses=0b{bootloader.ulp_bits}{bootloader.bodpd_bits}{bootloader.bodact_bits}{bootloader.spm_bit}
1634.build.core=tinymodern
1634.build.board=AVR_ATTINY1634
1634.build.extra_flags={build.speedfix}

